{
    "html": "2ESheet.html",
    "css": "2EStyle.css",
    "authors": "Dylan G. based on work by Stephen S. Rolltemplates and template integration by Elena S.",
    "preview": "2EPreview.png",
    "roll20userid": "35199, 1638432",
    "instructions": "This sheet includes everything you need to run a character or monster in an Advanced Dungeons and Dragons, Second Edition campaign, including resources from Skills & Powers. Please try to make sure there is a plain number value (and any appropriate + or - signs) in fields used for the weapon macros.
    "instructions1": "Updated to include shaped roll templates, most of which are integrated into the sheet roll buttons on the character sheet. There are 4 new roll templates available described below:
    "instructions2": "template:2Edefault - This new template is intended for general purpose use, it works much the same as the basic default template available to all roll20 users. Sheet rolls which have been converted to use this new template include Non-Weapon Proficiency Checks, Initiative Rolls for both weapons and spells, and Rogue Ability skill checks. This template is fully compatible with any current default rolltemplate macros you currently have, simply changing the template name in your macro from default to 2Edefault, will result in the macro displaying it's roll results using this template and it's embedded styling.   
    "instructions3": "This upgraded version of the standard default template has two properties which determine how the heading of the template is displayed the basic <name> property is unchanged, but an additional <subtitle> property has been added and will only display if you enter one, such as {{subtitle='Your Subtitle'}}. The 'name' property displays in 12pt bold, with the 'subtitle' immediately below it displayed in 8pt italics.
    "instructions4": "In the body of the template you can create any property name you like followed by an equals sign and then enter the roll or other information relevant to that property. This is intended to allow you to create special function roll macros with as much flexibility as possible. Three special propertys are also built into the template which allow you to enter descriptive text which will fill the entire width of the template and not be bound by the table column witdths of previous custom property entries. These special propterties are called 'desc', 'desc1', and 'desc2'. Three separate properties are included in the event you wish to break up the descriptive text for different possible outcomes.
    "instructions5": "template:2Eattack - This new template is designed to display all of the rolls and information necessary to resolve a weapon attack against any size target in one easy to understand template. The heading displays who is makign the attack, who the target is, what weapon was used, the armor class which the attack strikes, damage vs Small/Medium targets, and damage vs Large targets.
    "instructions6": "Additionally the template will automatically display a notification if the die roll for the attack resulted in a Critical Hit or a Fumble, and at your option can even display additional results which occur in those situations. This template has been integrated into the Repeating Weapons section of the character sheet. Since this one template now covers all of the necessary information for resolving attacks in one easy step, the sheet rolls for damage vs S/M, and damage vs L have been removed and the label on the 'Hit' roll button has been changed to 'Attack'.
    "instructions7": "The properties used by the 2Eattack template are: title, subtitle, weapon_used, ac_hit, dmg_s, and dmg_l. All of these properties should be included in any macro designed to use the 2Eattack template. There are also 2 optional properties: crit and fumble. These will display only if you add those properties to a macro using the template, and the rolls or information called by crit/fumble will only display if the attack roll designated in the ac_hit property results in a critical success or critical failure (by default a 20 or 1 respectively).
    "instructions8": "template:2Espell - 
    "instructions9": "template:2Esave - This template is designed to display all of the relevant information for a Saving Throw Roll. The heading displays the save being made and who is rolling. In the body the result of the die roll (including modifiers) is displayed, then the target number is displayed. Below this the template will automatically indicate if the roll was a success or failure. It does this by using the special helper functions available to rolltemplates."
    "instructions10": "The properties used by the 2Esave template are: savevs, character, savetarget, and saveroll. Here is a sample macro using the 2Esave template."
    "instructions11": "/w gm &{template:2Esave}{{savevs=Rods}}{{character=@{selected|token_name}}}{{savetarget=[[@{selected|rodtar}]]}}{{saveroll=[[d20?{Please enter Situational Modifiers to the current Saving Throw Roll (including the mathematical operator)|+0}@{selected|rodmod}]]}}"
}
